Revit 2015 API
Document.NewPointLoad Method (XYZ, XYZ, XYZ, Boolean, PointLoadType, SketchPlane)
Creates a new unhosted point load within the project.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public PointLoad NewPointLoad(
	XYZ point,
	XYZ force,
	XYZ moment,
	bool isReaction,
	PointLoadType symbol,
	SketchPlane plane
)
Visual Basic
Public Function NewPointLoad ( _
	point As XYZ, _
	force As XYZ, _
	moment As XYZ, _
	isReaction As Boolean, _
	symbol As PointLoadType, _
	plane As SketchPlane _
) As PointLoad
Visual C++
public:
PointLoad^ NewPointLoad(
	XYZ^ point,
	XYZ^ force,
	XYZ^ moment,
	bool isReaction,
	PointLoadType^ symbol,
	SketchPlane^ plane
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
The point of the PointLoad application.
force
Type: Autodesk.Revit.DB.XYZ
The 3d force.
moment
Type: Autodesk.Revit.DB.XYZ
The 3d moment.
isReaction
Type: System.Boolean
Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol
Type: Autodesk.Revit.DB.Structure.PointLoadType
The symbol of the PointLoad.
plane
Type: Autodesk.Revit.DB.SketchPlane
Indicate the work plane of the PointLoad.
Return Value
If successful, NewPointLoad returns an object for the newly created PointLoad. null is returned if the operation fails.
Examples
CopyC#
//Define the location at which the PointLoad is applied.
 XYZ point = new XYZ(0, 0, 4);
 //Define the 3d force.
 XYZ force = new XYZ(0, 0, -1);
 //Define the 3d moment.
 XYZ moment = new XYZ(0, 0, 0);
 //Set to True if you wish to create the reaction
 System.Boolean isReaction = true;
 PointLoad pointLoad = document.Create.NewPointLoad(point, force, moment, isReaction, null, null);
CopyVB.NET
'Define the location at which the PointLoad is applied.
Dim point As New XYZ(0, 0, 4)
'Define the 3d force.
Dim force As New XYZ(0, 0, -1)
'Define the 3d moment.
Dim moment As New XYZ(0, 0, 0)
'Set to True if you wish to create the reaction
Dim isReaction As System.Boolean = True
Dim pointLoad As PointLoad = document.Create.NewPointLoad(point, force, moment, isReaction, Nothing, Nothing)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | If the product is not Revit Structure.
See Also
Document Class
NewPointLoad Overload
Autodesk.Revit.Creation Namespace